Tekla Open API Reference for Tekla Structures 2025
Image Constructor
Overload List
Name | Description
Image(ViewBase, Point, String)
 Initializes a new instance of the Image class with the given parameters.
Image(ViewBase, Point, String, EmbeddedObjectAttributes)
 Initializes a new instance of the Image class using the specified attributes.
Image(ViewBase, Point, Size, String)
 Initializes a new instance of the Image class with the given parameters.
Image(ViewBase, Point, Size, String, EmbeddedObjectAttributes)
 Initializes a new instance of the Image class using the specified attributes.
Top
See Also
Reference
Image Class
Tekla.Structures.Drawing Namespace